---
kind: method
id: M:Autodesk.Revit.DB.CurveLoop.CreateViaCopy(Autodesk.Revit.DB.CurveLoop)
source: html/ea9a14d7-4b74-009e-b26e-5a90da82de2a.htm
---
# Autodesk.Revit.DB.CurveLoop.CreateViaCopy Method

Creates a new curve loop as a copy of the input.

## Syntax (C#)
```csharp
public static CurveLoop CreateViaCopy(
	CurveLoop original
)
```

## Parameters
- **original** (`Autodesk.Revit.DB.CurveLoop`) - The original curve loop.

## Returns
The copied curve loop.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null